1cdiplom/src/Documents/НачислениеФиксированныхПремий/НачислениеФиксированныхПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеФиксированныхПремий</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1cdiplom/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Начисление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

1cdiplom/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипУдержания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

1cdiplom/src/Documents/НачислениеФиксированныхПремий/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере()
	Для Каждого Строка Из Объект.СписокСотрудников Цикл
		НачислениеПремии = РегистрыРасчета.ДополнительныеНачисления.Добавить();
		НачислениеПремии.Сотрудник = Строка.Сотрудник;
		СуммаУдержания = Строка.СуммаПремии * (Константы.НДФЛ.Получить() / 100);
		НачислениеПремии.Начисление = СуммаУдержания;
		НачислениеПремии.Дата = ТекущаяДата();
		НачислениеПремии.Провести();
		
		НовоеУдержание = РегистрыРасчета.Удержания.Добавить();
		НовоеУдержание.Сотрудник = Строка.Сотрудник;
		НовоеУдержание.Удержано = СуммаУдержания;
		НовоеУдержание.ТипУдержания = "НДФЛ от начисления премии";
		НовоеУдержание.Дата = ТекущаяДата();
		НовоеУдержание.Провести();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого Строка Из Объект.СписокСотрудников Цикл
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обнаружена строка с незаполненным полем 'Сотрудник'!";
			Сообщение.Сообщить();
			Возврат;
		Иначе Если Не ЗначениеЗаполнено(Строка.СуммаПремии) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Обнаружена строка с незаполненным полем 'Сумма премии'!";
			Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//@skip-check invocation-form-event-handler
	ПередЗаписьюНаСервере();
КонецПроцедуры
